import 'package:flutter/material.dart';

class PrivacyPolicyPage extends StatelessWidget {
  const PrivacyPolicyPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          title: const Text('سياسة الخصوصية'),
        ),
        body: const SafeArea(
          child: SingleChildScrollView(
            padding: EdgeInsets.all(18),
            child: Text(
              '''
سياسة الخصوصية لتطبيق فودكس Foodx

نحن في فودكس نحترم خصوصية المستخدمين ونلتزم بحماية بياناتهم. توضح هذه السياسة كيفية جمع واستخدام وحفظ البيانات عند استخدام تطبيق فودكس.

1. البيانات التي نقوم بجمعها
قد نقوم بجمع الاسم، رقم الهاتف، العنوان، الموقع الجغرافي، تفاصيل الطلبات، صور المنتجات أو المستندات عند الحاجة، ورمز إشعارات الجهاز.

2. استخدام البيانات
نستخدم البيانات لإنشاء الحساب، تسجيل الدخول، تنفيذ الطلبات، تحديد موقع التوصيل، إرسال الإشعارات، متابعة حالة الطلب، تقديم الدعم، وتحسين الخدمة.

3. الموقع الجغرافي
يستخدم الموقع لتحديد عنوان الزبون، عرض المتاجر القريبة، وتتبع الطلبات والمندوبين أثناء التوصيل.

4. الصور والملفات
قد يستخدم التطبيق الصور لعرض المنتجات أو المتاجر أو مستندات التحقق الخاصة بالمندوبين أو المتاجر.

5. الإشعارات
نستخدم الإشعارات لإبلاغ المستخدم بحالة الطلب، قبول الطلب، الرسائل، والتنبيهات المهمة.

6. مشاركة البيانات
قد تتم مشاركة بيانات الطلب والعنوان مع المتجر والمندوب فقط لغرض تنفيذ الطلب والتوصيل. لا نقوم ببيع بيانات المستخدمين.

7. حماية البيانات
نستخدم إجراءات مناسبة لحماية البيانات، ويتم حفظ كلمات المرور بشكل مشفر.

8. حذف الحساب
يمكن للمستخدم طلب حذف حسابه أو بياناته من خلال التواصل مع دعم فودكس.

9. التواصل معنا
اسم التطبيق: فودكس Foodx
المطور: AH SoftTech
الدولة: العراق
رقم الدعم: +964 7704120794
البريد الإلكتروني: foodx.1991@gmail.com
              ''',
              style: TextStyle(
                fontSize: 16,
                height: 1.8,
                fontWeight: FontWeight.w500,
              ),
            ),
          ),
        ),
      ),
    );
  }
}